export const updates = [
  {
    date: '2026-1-2',
    content: [
      '新年快乐！希望在新的一年大家可以继续Study With Miku~',
      '不知道大家的学习数据怎么样了，主包自己是77小时，大家可以在获取歌单id的文章下面晒出自己的学习数据截图喔~',
      '真正修复了手机端"全屏""切换"按钮显示问题，感谢@gxxk-dev的贡献',
      '为滚动条样式自定义了样式'
    ]
  },
  {
    date: '2025-12-27',
    content: [
      '学习辛苦了！也请注意一下休息哦~',
      '对默认歌单添加了翻译，找歌更方便~',
      '修复手机端的ui显示不全问题',
      '修复手机端的"全屏""切换"按钮显示问题'
    ]
  },
  {
    date: '2025-12-19',
    content: [
      '网站即将满月，感谢大家的使用!',
      '账号系统制作中，以后可以登录MikuMod账号，记录学习时长等',
      '学习时长记录推出！可以记录学习了多久以及完成的番茄数~',
      '桌面壁纸应用即将推出~'
    ]
  }
]
